In [1]:
import pandas as pd

In [2]:
pd.read_excel(r'C:\Users\Karol\Desktop\Data science\test files\data.xlsx')

   si.No    Name        city country
0      1   karol     chennai   India
1      2     ber     chennai   India
2      3  princy  coimbatore   India

In [3]:
pd.read_csv(r'C:\Users\Karol\Desktop\Data science\test files\data.csv')

   si.No    Name        city country
0      1   karol     chennai   India
1      2     ber     chennai   India
2      3  princy  coimbatore   India

In [5]:
pd.read_csv(r'C:\Users\Karol\Desktop\Data science\test files\data.tsv',sep='\t')

   name  age     city
0  karo   35  chennai